{
    "name" : "Sinappsus GoGeothermal Official Plugin",
    "slug" : "sinappsus-go-geothermal-plugin",
    "version" : "0.2.4",
    "author"  : "Sinappsus",
    "author_uri" : "https://sinappsus.agency",
    "download_url" : "https://github.com/Go-GeoThermal/wordpress-gogeothermal-plugin/raw/master/sinappsus-go-geothermal-plugin.zip",
    "sections" : {
        "description" : "A custom WordPress plugin to integrate WooCommerce with The Go Geothermal API.",
    "changelog": "0.2.4 Added custom labels to User Mapping \n 0.1.8 add support for sending notes to api \n 0.1.7 import: add setting to control replacing existing featured image; skip overwrite unless enabled; logging for skips; 0.1.5 UI: provider filter alignment + taxonomy support; 0.1.4 orders: unify & harden sales order payload sending for ALL payment methods; add payment_provider + payment_provider_title fields; idempotent meta ggt_sales_order_sent; multi-hook strategy (checkout processed, payment complete, status change) with queued retry + exponential backoff; include provider meta for credit gateway and prevent duplicate sends; add logging + pending order queue.\n0.1.3 admin: show current product/user field mappings on their tabs; flexible import preview switched to field-first layout (first 3 samples) with full column coverage, tooltips and scroll; dashboard plugin enable toggle and inline notices when disabled or unauthenticated; fix split settings so saving Auth no longer resets other settings.\n0.1.2 update customer specific prices on checkout \n 0.1.1 update delivery date picker date format \n 0.1.0 add product grouping support on import \n 0.0.11 change api endpoints to new domain \n 0.0.10 add registration fields to woocommerce register form \n 0.0.8 ability to switch between testing and production \n 0.0.7 Added date picker for order delivery and submission/ updating of orders with custom payment status to Go Geothermal as sales orders for all payment methods. Previously, this was only done for credit payments.\n0.0.6 Init"
    },
    "banners":{
        "low" : "https://storage.sinappsus.us/gogeothermal/banner-772x250.png",
        "high" : "https://storage.sinappsus.us/gogeothermal/banner-772x250.png"
    }
}